DocumentJournals/АР_ДокументыНачисленияИОплатыПоДоговорамАренды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DocumentJournal>
		<Properties>
			<Name>АР_ДокументыНачисленияИОплатыПоДоговорамАренды</Name>
			<RegisteredDocuments>
				<xr:Item>Document.ПриходныйКассовыйОрдер</xr:Item>
				<xr:Item>Document.АР_АктСнятияПоказанийСчетчика</xr:Item>
				<xr:Item>Document.АР17_НачислениеАренднойПлаты</xr:Item>
				<xr:Item>Document.АР17_СчетНаАренду</xr:Item>
				<xr:Item>Document.АР17_НачислениеПени</xr:Item>
				<xr:Item>Document.ПоступлениеНаРасчетныйСчет</xr:Item>
			</RegisteredDocuments>
		</Properties>
		<ChildObjects>
			<Column>
				<Properties>
					<Name>Организация</Name>
					<References>
						<xr:Item>Document.АР17_СчетНаАренду.Attribute.Организация</xr:Item>
						<xr:Item>Document.АР_АктСнятияПоказанийСчетчика.Attribute.Организация</xr:Item>
						<xr:Item>Document.АР17_НачислениеАренднойПлаты.Attribute.Организация</xr:Item>
						<xr:Item>Document.АР17_НачислениеПени.Attribute.Организация</xr:Item>
						<xr:Item>Document.ПриходныйКассовыйОрдер.Attribute.Организация</xr:Item>
						<xr:Item>Document.ПоступлениеНаРасчетныйСчет.Attribute.Организация</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Контрагент</Name>
					<References>
						<xr:Item>Document.АР17_СчетНаАренду.Attribute.Контрагент</xr:Item>
						<xr:Item>Document.АР_АктСнятияПоказанийСчетчика.Attribute.Контрагент</xr:Item>
						<xr:Item>Document.АР17_НачислениеАренднойПлаты.Attribute.Контрагент</xr:Item>
						<xr:Item>Document.АР17_НачислениеПени.Attribute.Контрагент</xr:Item>
						<xr:Item>Document.ПриходныйКассовыйОрдер.Attribute.Контрагент</xr:Item>
						<xr:Item>Document.ПоступлениеНаРасчетныйСчет.Attribute.Контрагент</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<References>
						<xr:Item>Document.АР17_СчетНаАренду.Attribute.ДоговорКонтрагента</xr:Item>
						<xr:Item>Document.АР_АктСнятияПоказанийСчетчика.Attribute.ДоговорКонтрагента</xr:Item>
						<xr:Item>Document.АР17_НачислениеАренднойПлаты.Attribute.ДоговорКонтрагента</xr:Item>
						<xr:Item>Document.АР17_НачислениеПени.Attribute.ДоговорКонтрагента</xr:Item>
						<xr:Item>Document.ПриходныйКассовыйОрдер.Attribute.ДоговорКонтрагента</xr:Item>
						<xr:Item>Document.ПоступлениеНаРасчетныйСчет.Attribute.ДоговорКонтрагента</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>СуммаДокумента</Name>
					<References>
						<xr:Item>Document.АР17_СчетНаАренду.Attribute.СуммаДокумента</xr:Item>
						<xr:Item>Document.АР17_НачислениеАренднойПлаты.Attribute.СуммаДокумента</xr:Item>
						<xr:Item>Document.ПриходныйКассовыйОрдер.Attribute.СуммаДокумента</xr:Item>
						<xr:Item>Document.АР_АктСнятияПоказанийСчетчика.Attribute.СуммаДокумента</xr:Item>
						<xr:Item>Document.АР17_НачислениеПени.Attribute.СуммаДокумента</xr:Item>
						<xr:Item>Document.ПоступлениеНаРасчетныйСчет.Attribute.СуммаДокумента</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Ответственный</Name>
					<References>
						<xr:Item>Document.АР17_СчетНаАренду.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.АР_АктСнятияПоказанийСчетчика.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.АР17_НачислениеАренднойПлаты.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.АР17_НачислениеПени.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.ПриходныйКассовыйОрдер.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.ПоступлениеНаРасчетныйСчет.Attribute.Ответственный</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Комментарий</Name>
					<References>
						<xr:Item>Document.АР17_СчетНаАренду.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.АР_АктСнятияПоказанийСчетчика.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.АР17_НачислениеАренднойПлаты.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.АР17_НачислениеПени.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ПриходныйКассовыйОрдер.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ПоступлениеНаРасчетныйСчет.Attribute.Комментарий</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>АР_Москва</Name>
					<References>
						<xr:Item>Document.АР_АктСнятияПоказанийСчетчика.Attribute.АР_Москва</xr:Item>
						<xr:Item>Document.АР17_НачислениеАренднойПлаты.Attribute.АР_Москва</xr:Item>
						<xr:Item>Document.АР17_НачислениеПени.Attribute.АР_Москва</xr:Item>
						<xr:Item>Document.АР17_СчетНаАренду.Attribute.АР_Москва</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>АР_СанктПетербург</Name>
					<References>
						<xr:Item>Document.АР_АктСнятияПоказанийСчетчика.Attribute.АР_СанктПетербург</xr:Item>
						<xr:Item>Document.АР17_НачислениеАренднойПлаты.Attribute.АР_СанктПетербург</xr:Item>
						<xr:Item>Document.АР17_НачислениеПени.Attribute.АР_СанктПетербург</xr:Item>
						<xr:Item>Document.АР17_СчетНаАренду.Attribute.АР_СанктПетербург</xr:Item>
					</References>
				</Properties>
			</Column>
		</ChildObjects>
	</DocumentJournal>
</MetaDataObject>

InformationRegisters/АР_ШтрихКоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>АР_ШтрихКоды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ШтрихКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СсылкаНаОбъект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АР17_ЗаключениеАгентскогоДоговора</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/АР_ПереданныеДокументы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>АР_ПереданныеДокументы</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПереданоЭкземпляров</Name>
					<Comment>Если остаток &lt;&gt; 0 , документы переданы не вернулись</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АР17_НачислениеАренднойПлаты</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураВыданный</v8:Type>
						<v8:Type>cfg:DocumentRef.АР17_ЗаключениеДоговораАренды</v8:Type>
						<v8:Type>cfg:DocumentRef.АР17_ИнформационныйДокумент</v8:Type>
						<v8:Type>cfg:DocumentRef.АР17_ДополнительноеСоглашение</v8:Type>
						<v8:Type>cfg:DocumentRef.АР17_РасторжениеДоговораАренды</v8:Type>
						<v8:Type>cfg:DocumentRef.АР17_СчетНаАренду</v8:Type>
						<v8:Type>cfg:DocumentRef.АР_АктПриемаВозвратаАрендуемогоПомещения</v8:Type>
						<v8:Type>cfg:DocumentRef.АР_АктПриемаПередачиПомещенияВАренду</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектАренды</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ОбъектыАренды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/АР_ВозвращенныеДокументы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>АР_ВозвращенныеДокументы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АР17_НачислениеАренднойПлаты</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураВыданный</v8:Type>
						<v8:Type>cfg:DocumentRef.АР17_ЗаключениеАгентскогоДоговора</v8:Type>
						<v8:Type>cfg:DocumentRef.АР17_ЗаключениеДоговораАренды</v8:Type>
						<v8:Type>cfg:DocumentRef.АР17_ИнформационныйДокумент</v8:Type>
						<v8:Type>cfg:DocumentRef.АР17_ДополнительноеСоглашение</v8:Type>
						<v8:Type>cfg:DocumentRef.АР17_РасторжениеДоговораАренды</v8:Type>
						<v8:Type>cfg:DocumentRef.АР17_СчетНаАренду</v8:Type>
						<v8:Type>cfg:DocumentRef.АР_АктПриемаВозвратаАрендуемогоПомещения</v8:Type>
						<v8:Type>cfg:DocumentRef.АР_АктПриемаПередачиПомещенияВАренду</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DocumentJournals/АР_ДокументыНачисленияИОплатыПоДоговорамАренды/Forms/ФормаСписка/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Организация", ОтборОрганизация, ЗначениеЗаполнено(ОтборОрганизация));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборКонтрагентПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Контрагент", ОтборКонтрагент, ЗначениеЗаполнено(ОтборКонтрагент));
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтборОрганизация = ОбщегоНазначенияБПВызовСервера.УстановитьОтборПоОсновнойОрганизации(ЭтаФорма);
	
	//+са
	ТекушийПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	ПользовательСсылка = Справочники.Пользователи.НайтиПоНаименованию(СокрЛП(ТекушийПользователь.ПолноеИмя));
	//Если Не ПользовательСсылка.АР_Администратор Тогда
	//	Если ПользовательСсылка.АР_Москва Тогда
	//		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("АР_Москва");
	//		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//		ЭлементОтбора.Использование = Истина;
	//		ЭлементОтбора.ПравоеЗначение = Истина;
	//	Иначе
	//		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("АР_СанктПетербург");
	//		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//		ЭлементОтбора.Использование = Истина;
	//		ЭлементОтбора.ПравоеЗначение = Истина;
	//	КонецЕсли;
	//	
	//КонецЕсли;
	//-са
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменениеОсновнойОрганизации" Тогда
		ОтборОрганизация = ОбщегоНазначенияБПКлиент.ИзменитьОтборПоОсновнойОрганизации(Список, ,Параметр);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ШКПриИзменении(Элемент)
	
	Список.Отбор.Элементы.Очистить();
	эо = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	эо.Использование  = Истина;
	эо.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ШтрихКод");
	эо.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	эо.ПравоеЗначение = ШК;
	
	Если НЕ ЗначениеЗаполнено(ШК) Тогда
		Список.Отбор.Элементы.Очистить();
	КонецЕсли;	
	
	ШКПриИзмененииНаСервере();
	
	ПодключитьОбработчикОжидания("Ожидание",0.1,Истина);

КонецПроцедуры

&НаКлиенте
Процедура Ожидание()
	ТекущийЭлемент = Элементы.ШК;
КонецПроцедуры

&НаСервере
Процедура ШКПриИзмененииНаСервере()
	

	
	// Вставить содержимое обработчика.
// + Рогачев  Андрей от 17.08.2016  № 108890
		Запрос = Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	ШтрихКоды.ШтрихКод,
	|	ШтрихКоды.СсылкаНаОбъект
	|ИЗ
	|	РегистрСведений.АР_ШтрихКоды КАК ШтрихКоды
	|ГДЕ
	|	ШтрихКоды.ШтрихКод = &ШтрихКод";
	//Запрос.УстановитьПараметр("СсылкаНаОбъект",Ссылка);
	Запрос.УстановитьПараметр("ШтрихКод",ШК);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		// Штрих код есть !!!
		//------------------
		Если ЗначениеЗаполнено(Выборка.СсылкаНаОбъект.Передан) И Не ЗначениеЗаполнено(Выборка.СсылкаНаОбъект.Возвращен) Тогда 
			ДокОб=Выборка.СсылкаНаОбъект.ПолучитьОбъект();
			Движение = ДокОб.Движения.АР_ПереданныеДокументы.ДобавитьРасход();
			
			ОбъектАренды = Справочники.АР_ОбъектыАренды.ПустаяСсылка();
			
			Попытка 
				ОбъектАренды = Выборка.СсылкаНаОбъект.Состав[0].ОбъектАренды;
			Исключение
				Если Выборка.СсылкаНаОбъект.ПостояннаяЧастьАренднойПлаты.Количество() Тогда 
					ОбъектАренды = Выборка.СсылкаНаОбъект.ПостояннаяЧастьАренднойПлаты[0].ОбъектАренды;
				ИначеЕсли Выборка.СсылкаНаОбъект.ПеременнаяЧастьАренднойПлаты.Количество() Тогда 
					ОбъектАренды = Выборка.СсылкаНаОбъект.ПеременнаяЧастьАренднойПлаты[0].ОбъектАренды;
				КонецЕсли;
			КонецПопытки;
			
		//	Движение.Период       = ТекущаяДата();
		//	Движение.Организация  = Выборка.СсылкаНаОбъект.Организация;
		//	Движение.Документ     = Выборка.СсылкаНаОбъект.Ссылка;
		//	Движение.ОбъектАренды = ОбъектАренды;
		//	Движение.ПереданоЭкземпляров = 1;
		//	Движение.Контрагент   = Выборка.СсылкаНаОбъект.Контрагент;
		//	Движение.ДоговорКонтрагента = Выборка.СсылкаНаОбъект.ДоговорКонтрагента;
		//	Движение.Регистратор  = Выборка.СсылкаНаОбъект;
		//	
		//		ДокОб.Движения.АР_ПереданныеДокументы.УстановитьАктивность(Истина);
		//
		//	ДокОб.Движения.АР_ПереданныеДокументы.Записывать = Истина;	
		//	//ДокОб.Возвращен=Истина;
		//	ДокОб.Возвращен=ТекущаяДата();
		//	Попытка
		//		//ДокОб.Записать();
		//	Исключение
		//	конецпопытки;
			
			// + NAI Becar Комментирование Смирнов А.А. от 07.06.2018 18:35
			НаборЗаписей = РегистрыНакопления.АР_ПереданныеДокументы.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(Выборка.СсылкаНаОбъект.Ссылка);
			Запись = НаборЗаписей.ДобавитьРасход();
			Запись.Период = ТекущаяДата();
			Запись.Документ = Выборка.СсылкаНаОбъект.Ссылка;
			Запись.ПереданоЭкземпляров = 1;
			НаборЗаписей.Записать();
			// - NAI Becar Комментирование Смирнов А.А.
			
		КонецЕсли;
		
		// + NAI Becar Комментирование Смирнов А.А. от 10.05.2018 14:38
		НаборЗаписей = РегистрыСведений.АР_ВозвращенныеДокументы.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Документ.Установить(Выборка.СсылкаНаОбъект);
		Запись = НаборЗаписей.Добавить();
		Запись.Документ = Выборка.СсылкаНаОбъект;
		Запись.Дата = ТекущаяДата();
		НаборЗаписей.Записать();
		// - NAI Becar Комментирование Смирнов А.А.

		КонецЕсли;

КонецПроцедуры
